## Criando estrutura de dados

Series

In [212]:
import pandas as pd

Serie:
- Conjunto de dados unidimensional;

In [213]:
data = [1,2,3,4,5]

Criando a serie:

In [214]:
s = pd.Series(data)

In [215]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

Atribuindo um valor ao index das linhas através da concatenação de strings + list comprehension:

In [216]:
index = ['Linha' + str(i) for i in range(5)]

In [217]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

Criando a Series com o index criado:

In [218]:
s = pd.Series(data=data, index=index)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

Atribuindo um valor ao index das linhas através da concatenação de strings + list comprehension:
- O list comprehension irá retornar um dicionário:
    
        Chave : 'Linha' + str(i)'
    
        Valor:  'i + 1'

In [219]:
data = {'Linha' + str(i) : i + 1 for i in range(5)}

In [220]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

Criando Serie:

In [221]:
s = pd.Series(data=data)

In [222]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

Soma de uma Serie + valor:

In [223]:
s1 = s + 1
s1

Linha0    2
Linha1    3
Linha2    4
Linha3    5
Linha4    6
dtype: int64

Soma de Series:

In [224]:
s2 = s + s1
s2

Linha0     3
Linha1     5
Linha2     7
Linha3     9
Linha4    11
dtype: int64

## DataFrames

    Conjunto de dados bidimensionais;

    Um DataFrame é uma estrutura de dados tabular formada por um conjunto de Series.

In [225]:
data = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]

In [226]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

Criando DataFrame Simples:

In [227]:
df1 = pd.DataFrame(data=data)

In [228]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

Criando Rotulos para as colunas:

-   Atribuindo um valor as colunas através da concatenação de strings + list comprehension:

In [229]:
columns = ['Coluna ' + str(i) for i in range(3)]
columns

['Coluna 0', 'Coluna 1', 'Coluna 2']

Criando Rotulos para as linhas:

-   Atribuindo um valor aos index das linhas através da concatenação de strings + list comprehension:

In [230]:
index = ['Linha ' + str(i) for i in range(3)]
index

['Linha 0', 'Linha 1', 'Linha 2']

In [231]:
df1 = pd.DataFrame(data=data, index=index, columns=columns)
df1

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

# Criando um DataFrame contendo labels para index e columns :

-   Para criar um DataFrame que já inicie com rotulos nas linhas e colunas, podemos passar como conjunto de dados que irá virar o dataframe um dicionário contendo como conjunto chave:valor 
onde a chave recebe o dicionário com o nome da coluna e o valor recebe um dicionário contendo o conjunto chave:valor sendo index_linha:valor_linha;

In [232]:
data = {
    'Coluna 0':{'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
    'Coluna 1':{'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
    'Coluna 2':{'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}
}
data

{'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
 'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
 'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}

In [233]:
df2 = pd.DataFrame(data=data)
df2

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

Criando DataFrame atráves de uma lista de tuplas:

In [234]:
data = data = [
    (1,2,3),
    (4,5,6),
    (7,8,9)
]

In [235]:
df3 = pd.DataFrame(data=data, index=index, columns=columns)
df3

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [240]:
data = {
    'Coluna 0':{'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
    'Coluna 1':{'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
    'Coluna 3':{'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}
}

In [242]:
df4 = pd.DataFrame(data=data)
df4

         Coluna 0  Coluna 1  Coluna 3
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [250]:
data = {
    'Coluna 0':{'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
    'Coluna 1':{'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
    'Coluna 2':{'Linha 0': 3, 'Linha 1': 6, 'Linha 3': 9}
}

In [254]:
df_a = pd.DataFrame(data=data)
df_a

         Coluna 0  Coluna 1  Coluna 2
Linha 0       1.0       2.0       3.0
Linha 1       4.0       5.0       6.0
Linha 2       7.0       8.0       NaN
Linha 3       NaN       NaN       9.0

# Alterando valores internos do DataFrame:

In [236]:
#Se os dados do dataframe df1 forem maior que 0 então substitua-os por 'A'
df1[df1 > 0] = 'A'
df1

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A

In [237]:
#Se os dados do dataframe df2 forem maior que 0 então substitua-os por 'B'
df2[df2 > 0] = 'B'
df2

        Coluna 0 Coluna 1 Coluna 2
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B

In [238]:
#Se os dados do dataframe df3 forem maior que 0 então substitua-os por 'C'
df3[df3 > 0] = 'C'
df3

        Coluna 0 Coluna 1 Coluna 2
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [243]:
#Se os dados do dataframe df4 forem maior que 0 então substitua-os por 'D'
df4[df4 > 0] = 'D'
df4

        Coluna 0 Coluna 1 Coluna 3
Linha 0        D        D        D
Linha 1        D        D        D
Linha 2        D        D        D

In [255]:
#Se os dados do dataframe df_a forem maior que 0 então substitua-os por 'E'
df_a[df_a > 0] = 'E'
df_a

        Coluna 0 Coluna 1 Coluna 2
Linha 0        E        E        E
Linha 1        E        E        E
Linha 2        E        E      NaN
Linha 3      NaN      NaN        E

# Concatenado DataFrames usando as colunas como referência:

- Sintaxe:  dataframe_criar = pd.concat([dataframe1, dataframe2, dataframe3, ...])

- Irá criar um novo DataFrame usando como base os DataFrames passados dentro da lista;

- A concatenação será feita usando como referência as colunas dos DataFrames:
        - Se as colunas de todos os dataframes forem iguais, ele irá manter as mesmas colunas e adicionar as linhas uma abaixo da outra começando do primeiro DataFrame passado;

        - Se algum Dataframe tiver colunas diferentes, irá  adicionar a coluna ao novo dataframe e para os DataFrames que não tiverem valores nesta mesma coluna iram receber um NaN;

Exemplo de concatenação com DataFrames com as colunas iguais:

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

Exemplo de concatenação DataFrame com as colunas diferentes:

In [258]:
df6 = pd.concat([df1, df2, df3, df4])
df6

        Coluna 0 Coluna 1 Coluna 2 Coluna 3
Linha 0        A        A        A      NaN
Linha 1        A        A        A      NaN
Linha 2        A        A        A      NaN
Linha 0        B        B        B      NaN
Linha 1        B        B        B      NaN
Linha 2        B        B        B      NaN
Linha 0        C        C        C      NaN
Linha 1        C        C        C      NaN
Linha 2        C        C        C      NaN
Linha 0        D        D      NaN        D
Linha 1        D        D      NaN        D
Linha 2        D        D      NaN        D

# Concatenando DataFrames usando as linhas como referência:

- Sintaxe:  dataframe_criar = pd.concat([dataframe1, dataframe2, dataframe3, ...], axios = 1)

- Irá criar um novo DataFrame usando como base os DataFrames passados dentro da lista;

- A concatenação será feita usando como referência as linhas dos DataFrames:
        - Se as linhas de todos os dataframes forem iguais, ele irá manter as mesmas linhas e adicionar as colunas uma ao lado da outra começando do primeiro DataFrame passado;

        - Se algum Dataframe tiver linhas diferentes, irá  adicionar a linha ao novo dataframe e para as colunas que não tiverem valores nesta mesma linha iram receber um NaN;

Exemplo de concatenação por linhas usando Dataframes com as mesmas linhas:

In [248]:
df7 = pd.concat([df1, df2, df3], axis=1)
df7

,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2
Linha 0,A,A,A,B,B,B,C,C,C
Linha 1,A,A,A,B,B,B,C,C,C
Linha 2,A,A,A,B,B,B,C,C,C

Exemplo de concatenação por linhas usando Dataframes com as linhas diferentes:

In [261]:
df8 = pd.concat([df1, df2, df3,df4, df_a], axis=1)
df8

,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 3,Coluna 0,Coluna 1,Coluna 2
Linha 0,A,A,A,B,B,B,C,C,C,D,D,D,E,E,E
Linha 1,A,A,A,B,B,B,C,C,C,D,D,D,E,E,E
Linha 2,A,A,A,B,B,B,C,C,C,D,D,D,E,E,NaN
Linha 3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,E